## IMPORT LIBRARIES

In [2]:
import pandas as pd
# Panda is a library that helps us work with data that is in the form of  rows and columns(Excel)

Create a dictionary with a list of students name, subject and grade

In [42]:
#create a student's dictionary
student_info = {
'Student': ['Alice', 'Bob', 'Alice', 'Bob'],
'Subject': ['Maths', 'Math', 'Science', 'Science'],
'Grade': [90, 88, 95, 92]
}

In [8]:
student_info

{'Student': ['Asher', 'Pete', 'JJ', 'Jake'],
 'Subject': ['English', 'Math', 'Science', 'Art'],
 'Grade': [90, 88, 95, 92]}

CREATE A DATAFRAME : rows and columns
To access DataFrame method, we go through pandas

In [10]:
df = pd.DataFrame(student_info)

In [11]:
df

  Student  Subject  Grade
0   Asher  English     90
1    Pete     Math     88
2      JJ  Science     95
3    Jake      Art     92

Generate a simple generative statistics: 
We use GroupBy to group the data by subject. This creates separate groups for 'Math' and 'Science'.
We apply the mean() function to the 'Grade' column within each group. This calculates the average grade for each subject

In [15]:
groupby_data = df.groupby('Subject')['Grade'].mean()

In [16]:
groupby_data

Subject
Art        92.0
English    90.0
Math       88.0
Science    95.0
Name: Grade, dtype: float64

 We can use the plain mean to calculate the mean of the a column for Grades

In [17]:
grade_mean = df['Grade'].mean()

In [18]:
grade_mean

np.float64(91.25)

IMPORTING A COMPLETE DATASET

In [3]:
# imports the students_peformance_data into the enviroment
students_df = pd.read_csv('student_performance_data.csv')

In [27]:
students_df.head()

,StudentID,Gender,Age,StudyHoursPerWeek,AttendanceRate,GPA,Major,PartTimeJob,ExtraCurricularActivities
0,1,Male,24,37,90.75,3.47,Arts,Yes,No
1,2,Female,22,37,74.90,2.32,Education,No,No
2,3,Male,22,10,53.36,2.38,Business,No,No
3,4,Male,24,10,70.26,3.46,Science,Yes,No
4,5,Male,18,19,74.87,2.31,Education,Yes,No

In [24]:
students_df.tail()

,StudentID,Gender,Age,StudyHoursPerWeek,AttendanceRate,GPA,Major,PartTimeJob,ExtraCurricularActivities
495,496,Male,22,37,76.61,2.97,Science,No,No
496,497,Male,23,11,56.29,3.20,Science,No,No
497,498,Female,20,6,56.64,3.20,Science,No,Yes
498,499,Male,22,18,57.18,2.05,Business,No,Yes
499,500,Female,24,21,96.99,2.64,Engineering,No,No

Calculate the mean age, StudyHoursPerWeek, GPA

In [35]:
age_mean = students_df['Age'].mean()
age_mean

np.float64(20.956)

In [33]:
StudyHoursPerWeek_mean = students_df['StudyHoursPerWeek'].mean()
StudyHoursPerWeek_mean

np.float64(19.876)

In [36]:
GPA_mean = students_df['GPA'].mean()
GPA_mean

np.float64(2.9851600000000005)

return stats.apply(lambda x: f"{x:.2f}%")

In [4]:
stats = students_df.describe()
stats

        StudentID         Age  StudyHoursPerWeek  AttendanceRate        GPA
count  500.000000  500.000000         500.000000      500.000000  500.00000
mean   250.500000   20.956000          19.876000       74.990380    2.98516
std    144.481833    2.000517          11.471347       14.565917    0.56362
min      1.000000   18.000000           1.000000       50.010000    2.00000
25%    125.750000   19.000000          10.000000       62.607500    2.48750
50%    250.500000   21.000000          20.500000       75.730000    3.00000
75%    375.250000   23.000000          30.000000       87.220000    3.48000
max    500.000000   24.000000          39.000000       99.970000    3.99000

Group By function in pandas

In [38]:
""" GroupBy Function. There are many everyday tasks that are comparable to the workings of this function. 
 For example, after laundry, you sort your clothes into different piles based on color or type. 
 Once the sorting is over, further operations can be performed on the separated clothes, like packing them in different areas of the closet.
GroupBy is also used to group data by one or more columns. Once grouped, we can perform various operations on each group, 
 such as calculating summary statistics (like mean, median, or standard deviation), applying functions, or 
 filtering data. This makes it easier to analyze and understand patterns within the data. 
Let's look at an example:
"""

" GroupBy Function. There are many everyday tasks that are comparable to the workings of this function. \n For example, after laundry, you sort your clothes into different piles based on color or type. \n Once the sorting is over, further operations can be performed on the separated clothes, like packing them in different areas of the closet.\nGroupBy is also used to group data by one or more columns. Once grouped, we can perform various operations on each group, \n such as calculating summary statistics (like mean, median, or standard deviation), applying functions, or \n filtering data. This makes it easier to analyze and understand patterns within the data. \nLet's look at an example:\n"

Q1. For each gender, which major has the highest total study hours per week?

In [39]:
# Grouping by 'Gender' and 'Major', then summing the 'StudyHoursPerWeek' for each group
grouped = students_df.groupby(['Gender', 'Major'])['StudyHoursPerWeek'].sum()

# Resetting the index to make it easier to work with
grouped = grouped.reset_index()

# Finding the major with the highest study hours per gender
max_study_hours_per_gender = grouped.loc[grouped.groupby('Gender')['StudyHoursPerWeek'].idxmax()]

# Displaying the result
max_study_hours_per_gender

   Gender      Major  StudyHoursPerWeek
1  Female   Business               1229
7    Male  Education               1212

 Q2. For each major, what is the percentage contribution of its total study hours to the overall total study hours?